package planar_structure.subroutines

object StandardParameters {
  /**
   * ПРЕДЕЛЫ ТЕКУЧЕСТИ МАТЕРИАЛОВ КОЛЕС
   */
  val SGT = Array(700, 780, 800, 590, 780, 780, 700, 700, 780)
  val SGTA = SGT.slice(0,3)
  val SGTG = SGT.slice(3, 6)
  val SGTB = SGT.slice(6,9)

  /**
   * РЯД МОДУЛЕЙ ПО ГОСТ
   */
  val MS = Array(0.2f, 0.25f,0.3f,0.4f,0.5f,0.6f,0.7f,0.8f,1f,1.25f,1.5f,2f,2.5f,3f,3.5f,4f,4.5f,5f,
    6f,7f,8f)
  /**
   * КОЭФФИЦИЕНТЫ ПРИВЕДЕНИЯ ПЕРЕМЕННОГО РЕЖИМА НАГРУЖЕНИЯ К ПОСТОЯННОМУ
   */
  val KFE = Array(Array(1f, 0.3f,0.14f,0.06f,0.038f, 0.013f),
    Array(1f, 0.2f,0.1f, 0.04f, 0.016f,0.004f))
  val KHE= Array(1f, 0.5f,0.25f,0.18f,0.125f,0.063f)
  /**
   * Ряд стандартных чисел RA40
   */
  val RA40S = Array(10f, 10.5f, 11f, 11.5f, 12f, 13f, 14f,15f,16f,17f,18f,19f,
    20f,21f,22f,24f,25f,26f,28f,30f,32f,34f,36f,38f,40f,42f,45f,48f,50f,53f,56f,60f,
    63f,67f,71f,75f,80f,85f,90f,95f,100f,105f,110f,120f,125f,130f,140f,150f,160f,170f,
    180f,190f,200f,210f,220f,240f,250f,260f,280f,300f,320f,340f,360f,380f,400f,420f,450f,
    480f,500f,530f,560f,600f,630f,670f,710f,750f,800f,850f,900f,950f)
  /**
   * Коэффициент учитывает приложение нагрузки в зависимости от материала
   * при односторонней нагрузке - 1
   * при улучшенной стали - 0.65
   * при закалке ТВЧ - 0.75
   * при цементированной стали - 0.9
   * в подпрограмме DOPN, если KFC не равен единице, значение коэфф-та автоматически
   * подберется по твердости колеса
   */
  val KFC = Array(0.65f,0.75f, 0.9f, 1f)
  /**
   * массив индексов типового нрежима нагружения передачи
   * 0 - постоянный
   * 1 - тяжелый
   * 2 - средний равновероятный
   * 3 - средний нормальный
   * 4 - легкий
   * 5- особо легкий
   * режим передачи отражает зависимость отношения (T_i / T_max) от (N_i / N_sum)
   * необходимо выбрать какой режим использовать для каждого зацепления (одинаковый)
   * можно переложить выбор пользователю
   */
  val NRR = (0,1,2,3,4,5)

}
